app/views/cart/_cart.html.erb

SELECT `cart_items`.* FROM `cart_items` WHERE `cart_items`.`cart_id` = 5
---
<p id='cart_total'><strong>Total: <%= sprintf "%0.2f €", @cart.total %></strong></p>
<% unless @cart.cart_items.empty? %>