app/views/admin/article/_form.html.erb

  <p><label for="article[supplier_ids][]">Proveedores</label><br/>
  <%= select_tag 'article[supplier_ids][]', options_from_collection_for_select(@suppliers, :id, :name,
      @article.suppliers.collect{|supplier| supplier.id}), { :multiple => true, :size => 5 } %></p>
---
SELECT `suppliers`.* FROM `suppliers` INNER JOIN `articles_suppliers` ON `suppliers`.`id` = `articles_suppliers`.`supplier_id` WHERE `articles_suppliers`.`article_id` = 1