app/controllers/admin/article_controller.rb

INSERT INTO `articles` (`title`, `manufacturer_id`, `reference`, `blurb`, `price`, `size`, `cover_image_file_name`, `cover_image_content_type`, `cover_image_file_size`, `cover_image_updated_at`, `manufactured_at`, `created_at`, `updated_at`) VALUES ('dsads', 5, '199-199-199-4', 'cdsvcsd', 45.0, 41, 'WhatsApp_Image_2017-03-19_at_10.06.21.jpeg', 'image/jpeg', 427170, '2017-04-06 17:05:08', '2017-04-06 17:04:00', '2017-04-06 17:05:08', '2017-04-06 17:05:08')
---
  def create
    @article = Article.new(article_params)
    if @article.save

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
---
  def edit
    load_data
    @article = Article.find(params[:id])

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
UPDATE `articles` SET `title` = 'Nike Tanjun (GS) - Zapatillas para niño, multicolor', `manufacturer_id` = 6, `reference` = '199-199-199-5', `blurb` = 'h1. Nike Tanjun (GS) - Zapatillas para niño, multicolor\r\n* Multiusos\r\n## Baratas', `price` = 12.0, `size` = 41, `cover_image_file_name` = '5.jpg', `cover_image_content_type` = 'image/jpeg', `cover_image_file_size` = 5729, `cover_image_updated_at` = '2017-04-06 18:23:06', `updated_at` = '2017-04-06 18:23:06' WHERE `articles`.`id` = 8
---
  def update
    @article = Article.find(params[:id])
    if @article.update_attributes(article_params)

SELECT  `articles`.* FROM `articles`  ORDER BY manufacturer_id LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `articles`
---
  def index
    sort_by = params[:sort_by]
    @articles = Article.order(sort_by).paginate(:page => params[:page], :per_page => 5)

SELECT `suppliers`.* FROM `suppliers`
SELECT `manufacturers`.* FROM `manufacturers`
---
    def load_data
      @suppliers = Supplier.all
      @manufacturers = Manufacturer.all