app/controllers/admin/article_controller.rb

INSERT INTO `articles` (`title`, `manufacturer_id`, `manufactured_at`, `reference`, `blurb`, `price`, `size`, `created_at`, `updated_at`) VALUES ('A new Article of Ruby', 3, '2017-04-13 20:16:05', '123-123-123-X', 'A new Article of Ruby', 45.5, 40, '2017-04-13 20:16:06', '2017-04-13 20:16:06')
---
  def create
    @article = Article.new(article_params)
    if @article.save

UPDATE `articles` SET `title` = 'A very new Article of Ruby', `manufactured_at` = '2017-04-13 20:16:06', `blurb` = 'A very new Article of Ruby', `price` = 50.0, `size` = 42, `updated_at` = '2017-04-13 20:16:06' WHERE `articles`.`id` = 26
---
  def update
    @article = Article.find(params[:id])
    if @article.update_attributes(article_params)