app/controllers/admin/manufacturer_controller.rb

  def create
    @manufacturer = Manufacturer.new(manufacturer_params)
    if @manufacturer.save
---
INSERT INTO `manufacturers` (`name`, `created_at`, `updated_at`) VALUES ('fabricante1', '2017-03-21 11:38:50', '2017-03-21 11:38:50')

  def edit
    @manufacturer = Manufacturer.find(params[:id])
---
SELECT  `manufacturers`.* FROM `manufacturers` WHERE `manufacturers`.`id` = 2 LIMIT 1

  def update
    @manufacturer = Manufacturer.find(params[:id])
    if @manufacturer.update_attributes(manufacturer_params)
---
SELECT  `manufacturers`.* FROM `manufacturers` WHERE `manufacturers`.`id` = 2 LIMIT 1
UPDATE `manufacturers` SET `name` = 'fabricante1a', `updated_at` = '2017-03-21 11:39:04' WHERE `manufacturers`.`id` = 2

  def destroy
    @manufacturer = Manufacturer.find(params[:id])
    @manufacturer.destroy
---
SELECT  `manufacturers`.* FROM `manufacturers` WHERE `manufacturers`.`id` = 2 LIMIT 1
DELETE FROM `manufacturers` WHERE `manufacturers`.`id` = 2

  def show
    @manufacturer = Manufacturer.find(params[:id])
---
SELECT  `manufacturers`.* FROM `manufacturers` WHERE `manufacturers`.`id` = 2 LIMIT 1

  def index
    @manufacturers = Manufacturer.all
---
SELECT `manufacturers`.* FROM `manufacturers`