app/controllers/admin/order_controller.rb

SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 4 LIMIT 1
---
  def close
    order = Order.find(params[:id])

SELECT  `orders`.* FROM `orders` WHERE (status = 'open') LIMIT 10 OFFSET 0
---
  def index
    @status = params[:id]
    if @status.blank?
      @status = ''
      conditions = nil
    else
      conditions = "status = '#{@status}'"
    end
    @orders = Order.where(conditions).paginate(:page => params[:page], :per_page => 10)

SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1
DELETE FROM `orders` WHERE `orders`.`id` = 1
---
  def destroy
    @order = Order.find(params[:id])
    @order.destroy