app/controllers/admin/supplier_controller.rb

  def update
    @supplier = Supplier.find(params[:id])
    if @supplier.update_attributes(supplier_params)
---
UPDATE `suppliers` SET `first_name` = 'Gabriel', `updated_at` = '2017-04-08 18:39:12' WHERE `suppliers`.`id` = 1