app/controllers/admin/supplier_controller.rb

  def create
    @supplier = Supplier.new(supplier_params)
    if @supplier.save
---
INSERT INTO `suppliers` (`first_name`, `last_name`, `created_at`, `updated_at`) VALUES ('dd', 'ee', '2017-03-28 09:49:44', '2017-03-28 09:49:44')

  def edit
    @supplier = Supplier.find(params[:id])
---
SELECT  `suppliers`.* FROM `suppliers` WHERE `suppliers`.`id` = 1 LIMIT 1

  def update
    @supplier = Supplier.find(params[:id])
    if @supplier.update_attributes(supplier_params)
---
SELECT  `suppliers`.* FROM `suppliers` WHERE `suppliers`.`id` = 1 LIMIT 1
UPDATE `suppliers` SET `first_name` = 'ddrt', `last_name` = 'eede', `updated_at` = '2017-03-28 09:50:14' WHERE `suppliers`.`id` = 1

  def destroy
    @supplier = Supplier.find(params[:id])
    @supplier.destroy
---
SELECT  `suppliers`.* FROM `suppliers` WHERE `suppliers`.`id` = 1 LIMIT 1
DELETE FROM `suppliers` WHERE `suppliers`.`id` = 1

  def show
    @supplier = Supplier.find(params[:id])
---
SELECT  `suppliers`.* FROM `suppliers` WHERE `suppliers`.`id` = 1 LIMIT 1

  def index
    @suppliers = Supplier.all
---
SELECT `suppliers`.* FROM `suppliers`