app/controllers/cart_controller.rb

  def add
    @article = Article.find params[:id]
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 11 LIMIT 1

  def remove
    @article = Article.find params[:id]
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 4 LIMIT 1

  def clear
    @page_title = 'Vaciar el carrito'
    if request.post?
      @cart.cart_items.destroy_all
---
DELETE FROM `cart_items` WHERE `cart_items`.`id` = 1