app/controllers/catalog_controller.rb

  def index
    @articles = Article.order("articles.id desc").includes(:suppliers, :manufacturer).paginate(:page => params[:page], :per_page => 5)
---
SELECT  `articles`.* FROM `articles`  ORDER BY articles.id desc LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `articles`
SELECT `manufacturers`.* FROM `manufacturers` WHERE `manufacturers`.`id` IN (5, 7, 6)
SELECT `suppliers`.* FROM `suppliers` WHERE `suppliers`.`id` IN (2, 3, 4, 5, 6)

  def search
    @page_title = "Buscar"
    if params[:commit] == "Buscar" || params[:q]
      @articles = Article.where 'title LIKE ?', "%#{params[:q]}%"
      unless @articles.size > 0
---
SELECT `articles`.* FROM `articles` WHERE (title LIKE '%a%')
SELECT COUNT(*) FROM `articles` WHERE (name LIKE '%zapa%')