app/controllers/checkout_controller.rb

SELECT  1 AS one FROM `articles` INNER JOIN `cart_items` ON `articles`.`id` = `cart_items`.`article_id` WHERE `cart_items`.`cart_id` = 8 LIMIT 1
---
  def index
    @order = Order.new
    @page_title = 'Pago'
    if @cart.articles.empty?

SELECT  `carts`.* FROM `carts` WHERE `carts`.`id` = 8 LIMIT 1
INSERT INTO `orders` (`email`, `phone_number`, `ship_to_first_name`, `ship_to_last_name`, `ship_to_address`, `ship_to_city`, `ship_to_postal_code`, `ship_to_country_code`, `customer_ip`, `status`, `created_at`, `updated_at`) VALUES ('dffsa@sdds.es', '956956956', 'ljhli ', 'ih ', 'iuhiou', 'cay', '11100', 'ES', '127.0.0.1', 'open', '2017-05-02 10:42:04', '2017-05-02 10:42:04')
DELETE FROM `cart_items` WHERE `cart_items`.`id` = 1
---
  def submit_order
    @cart = Cart.find(params[:cart][:id]) # <========================== sprint 7 si funciona todo probar a quitar
    @order = Order.new(order_params)
    @order.ship_to_country_code = @order.ship_to_country_code.upcase
    @order.customer_ip = request.remote_ip
    @order.status = 'open'
    @page_title = 'Pago'
    populate_order

    if @order.save
      if @order.process
        flash[:notice] = 'Su orden ha sido enviada y será procesada inmediatamente.'
        session[:order_id] = @order.id
        @cart.cart_items.destroy_all # empty shopping cart