app/controllers/forum_controller.rb

  def create
    @post = ForumPost.new(post_params)
    if @post.save
---
INSERT INTO `forum_posts` (`name`, `subject`, `body`, `parent_id`, `created_at`, `updated_at`) VALUES ('George', 'Rats!', 'Rats!!!', 6, '2017-06-02 08:46:32', '2017-06-02 08:46:32')