app/controllers/forum_controller.rb

  def create
    @post = ForumPost.new(post_params)
    if @post.save
---
INSERT INTO `forum_posts` (`name`, `subject`, `body`, `root_id`, `parent_id`, `depth`, `created_at`, `updated_at`) VALUES ('toni de cay', 'que dise killo', 'ke me deje', 1, 1, 1, '2017-05-23 09:58:26', '2017-05-23 09:58:26')

  def reply
    reply_to = ForumPost.find(params[:id])
---
SELECT  `forum_posts`.* FROM `forum_posts` WHERE `forum_posts`.`id` = 1 LIMIT 1

  def destroy
    @post = ForumPost.find(params[:id])
    @posts = ForumPost.where(root_id: @post.root_id)
    @posts.each do |post|
      post.destroy
---
SELECT  `forum_posts`.* FROM `forum_posts` WHERE `forum_posts`.`id` = 2 LIMIT 1
SELECT `forum_posts`.* FROM `forum_posts` WHERE `forum_posts`.`root_id` = 1
DELETE FROM `forum_posts` WHERE `forum_posts`.`id` = 1

  def show
    @post = ForumPost.find(params[:id])
    @posts = ForumPost.where(root_id: @post.root_id)
---
SELECT  `forum_posts`.* FROM `forum_posts` WHERE `forum_posts`.`id` = 1 LIMIT 1
SELECT `forum_posts`.* FROM `forum_posts` WHERE `forum_posts`.`root_id` = 1

  def index
    @posts = ForumPost.order('root_id desc , created_at').paginate(:page => params[:page], :per_page => 10)
---
SELECT  `forum_posts`.* FROM `forum_posts`  ORDER BY root_id desc , created_at LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `forum_posts`