app/controllers/user_controller.rb

  def new
    @user = User.new
    @page_title = 'Crear nueva cuenta'
    if current_user
      flash[:notice] = 'Sólo una cuenta puede ser creada.'
      redirect_to :controller => 'about', :action => 'index'
    else
      # only when there are no accounts it allows to create a new one, unique in the system
      redirect_to :controller => 'user_sessions', :action => 'new' unless User.count == 0
---
SELECT COUNT(*) FROM `users`

  def create
    @user = User.new(user_params)
    if @user.save # the new user has been logged in automatically
---
INSERT INTO `users` (`name`, `login`, `email`, `password_salt`, `crypted_password`, `persistence_token`, `perishable_token`, `login_count`, `current_login_at`, `current_login_ip`, `last_request_at`, `created_at`, `updated_at`) VALUES ('Administrador', 'admin', 'antonio.ruizrondan@alum.uca.es', 'LAIJXoUoCi1FP1YkRn1P', '400$8$20$82da4a384f7c24be$6cf11156ba409e6d58a618f9084fe427a4e6f898da2cd4783c6746980d75dcb2', 'c5aa200b5a504e87ab93a3e89ecf18adf7b350f0e8db8dde75a9e432d466fec7f22869ae9cb0a05ec3f89a1443eb94424630ef2dc28bf8e60c9ba410ed1a2f7e', 'v6Hlpwje5UtGnUJpVUVo', 1, '2017-05-15 18:40:41', '127.0.0.1', '2017-05-15 18:40:41', '2017-05-15 18:40:41', '2017-05-15 18:40:41')

  def update
    @user = current_user
    if @user.update_attributes(user_params)
---
UPDATE `users` SET `name` = 'administrador', `password_salt` = 'po2nnyOgaVUWOFjAHd5U', `crypted_password` = '400$8$16$68da6ffd5d69d970$356c99959b268d8e20f6a6383ee3497fa6591382db1f6ead9faa225cbf615505', `persistence_token` = 'e16e69b6c615949ac2d5cc5f8693b5fa1a510a6e308d5af4a0576abb189f1dee66313d088002f247d26793dce0e4f41055b0d3f9826a8aabd4a15563b437b224', `perishable_token` = 'TgMNbmmJ6u2qrprg6T', `last_request_at` = '2017-05-16 17:31:18', `login_count` = 2, `last_login_at` = '2017-05-16 17:29:23', `current_login_at` = '2017-05-16 17:31:18', `last_login_ip` = '127.0.0.1', `updated_at` = '2017-05-16 17:31:18' WHERE `users`.`id` = 2